import { timelineDate, yearsDateInfo } from "@/utils/types";
export const HistoryPageMock: timelineDate[] = [
  {
    title: "Наука",
    firstYear: 2010,
    lastYear: 2020,
    yearsDate: [
      {
        year: 2010,
        text: "Обнаружен экзопланета Gliese 581g, потенциально пригодная для жизни.",
      },
      {
        year: 2015,
        text: "Проведён первый успешный редактирование генома человека с помощью CRISPR-Cas9.",
      },
      {
        year: 2020,
        text: "Создана первая квантовая система, превысившая возможности классических суперкомпьютеров.",
      },
      {
        year: 2020,
        text: "Запуск автоматического космического аппарата для исследования Солнца Solar Orbiter",
      },
    ],
  },
  {
    title: "Технологии",
    firstYear: 2007,
    lastYear: 2025,
    yearsDate: [
      {
        year: 2007,
        text: "Apple представила первый iPhone, изменивший рынок мобильных устройств.",
      },
      {
        year: 2016,
        text: "Запуск первой массовой VR-гарнитуры Oculus Rift.",
      },
      {
        year: 2021,
        text: "Развитие метавселенной и виртуальных миров от Meta (Facebook).",
      },
      {
        year: 2025,
        text: "Первые полностью автономные такси вышли на улицы крупных городов.",
      },
    ],
  },
  {
    title: "Искусство",
    firstYear: 2010,
    lastYear: 2023,
    yearsDate: [
      {
        year: 2010,
        text: "Выставка современного искусства в Лондоне привлекла рекордное количество посетителей.",
      },
      {
        year: 2018,
        text: "Алгоритм искусственного интеллекта впервые написал картину, проданную на аукционе Christie’s.",
      },
      {
        year: 2020,
        text: "Мировой бум цифрового искусства и NFT-токенов.",
      },
      {
        year: 2023,
        text: "Создан первый полнометражный фильм с использованием ИИ-сценария.",
      },
    ],
  },
  {
    title: "Спорт",
    firstYear: 2012,
    lastYear: 2024,
    yearsDate: [
      {
        year: 2012,
        text: "Олимпийские игры в Лондоне стали самыми масштабными в истории Великобритании.",
      },
      {
        year: 2018,
        text: "Франция выиграла чемпионат мира по футболу в России.",
      },
      {
        year: 2021,
        text: "Олимпиада в Токио прошла без зрителей из-за пандемии COVID-19.",
      },
      {
        year: 2024,
        text: "Ожидаются Олимпийские игры в Париже.",
      },
    ],
  },
  {
    title: "Политика",
    firstYear: 2014,
    lastYear: 2022,
    yearsDate: [
      {
        year: 2014,
        text: "Произошёл Brexit — Великобритания проголосовала за выход из ЕС.",
      },
      {
        year: 2016,
        text: "Президентом США стал Дональд Трамп.",
      },
      {
        year: 2020,
        text: "Выборы президента США выиграл Джо Байден.",
      },
      {
        year: 2022,
        text: "Продолжаются глобальные реформы в области энергетики и климата.",
      },
    ],
  },
  {
    title: "Космос",
    firstYear: 2011,
    lastYear: 2025,
    yearsDate: [
      {
        year: 2011,
        text: "Завершена программа космических шаттлов NASA.",
      },
      {
        year: 2018,
        text: "SpaceX успешно запустила ракету Falcon Heavy.",
      },
      {
        year: 2021,
        text: "Илон Маск объявил о планах миссии на Марс к 2030 году.",
      },
      {
        year: 2025,
        text: "Запуск первой постоянной базы на Луне в рамках международной программы.",
      },
    ],
  },
];